export ann_a, num_a, quad_a, quads_a, nums_a

ann_a(α, λ, ω, γ, t) = (α + (λ/ω)) * exp(-γ * t * exp(-1im * ω/γ)) - (λ/ω)

quad_a(α, λ, ω, γ, t) = (α + (λ/ω)) * exp(-γ * t * (1 - exp(1im * ω/γ))) + (conj(α) + (λ/ω)) * exp(-γ * t * (1 - exp(-1im * ω/γ))) - 2 * (λ/ω)

num_a(α, λ, ω, γ, t) = abs2(α) + (λ/ω) * (α + conj(α)) + 2 * (λ/ω)^2 - (λ/ω) * ((α + (λ/ω)) * exp(-γ * t * (1 - exp(1im * ω/γ))) + (conj(α) + (λ/ω)) * exp(-γ * t * (1 - exp(-1im * ω/γ))))

μ(r) = cosh(r)
ν(r, θ) = exp(1im * θ) * sinh(r)

quads_a(α, r, θ, λ, ω, γ, t) = (μ(r) * conj(α) + conj(ν(r, θ)) * α + (λ/ω)) * exp(-γ * t * (1 - exp(1im * ω/γ))) + (μ(r) * α + ν(r, θ) * conj(α) + (λ/ω)) * exp(-γ * t * (1 - exp(-1im * ω/γ))) - 2 * (λ/ω)

nums_a(α, r, θ, λ, ω, γ, t) = ((μ(r)^2 + abs2(ν(r, θ))) * abs2(α) - μ(r) * (ν(r, θ) * conj(α)^2 + conj(ν(r, θ))α^2) + (λ/ω) * ((μ(r) - conj(ν(r, θ))) * α + (μ(r) - ν(r, θ)) * conj(α)) + 2 * (λ/ω)^2 + abs2(ν(r, θ))) - (λ/ω) * ((μ(r) * conj(α) - conj(ν(r, θ)) * α + (λ/ω)) * exp(-γ * t * (1 - exp(1im * ω/γ))) + (μ(r) * α + ν(r, θ) * conj(α) + (λ/ω)) * exp(-γ * t * (1 - exp(-1im * ω/γ))))
